import { Section } from "./Section";

export function Competition() {
  return (
    <Section id="pdtn" eyebrow="01 — Ο διαγωνισμός" title="Τι είναι ο ΠΔΤΝ;">
      <p>
      Ο νεοσύστατος Πανελλήνιος Διαγωνισμός Τεχνητής Νοημοσύνης είναι μία πρωτοβουλία 
      για μαθητές η οποία ξεκίνησε το έτος 2024 (έχει διεκπεραιωθεί 2 φορές) και 
      ακολουθεί τα πρότυπα των υπόλοιπων πανελλήνιων διαγωνισμών για επιστήμες (ολυμπιάδες 
      μαθηματικών, φυσικής, προγραμματισμού, κλπ).
      </p>
      <p>
      Όλα τα προβλήματα προς λύση είναι hands-on σε Python notebooks. Συνήθως δίνεται ένα 
      notebook το οποίο περιγράφει και εξερευνεί ελαφρώς την άσκηση και ο μαθητής καλείται 
      να αναπτύξει κώδικα στο notebook και να επιλύσει το πρόβλημα.
      </p>
      <p>
      Ο διαγωνισμός έχει δύο φάσεις. Η πρώτη είναι εξ αποστάσεως όπου οι μαθητές 
      εξερευνούν τα προβλήματα ελεύθερα και μόνοι τους σε μεγάλο διάστημα χρόνου και 
      η δεύτερη φάση είναι ολιγόωρη και με φυσική παρουσία.
      </p>
    </Section>
  );
}
